src/DocumentJournals/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DocumentJournal>
  <name>УчетРабочегоВремени</name>
  <registeredDocuments>Document.ЕжедневныйОтчет</registeredDocuments>
  <registeredDocuments>Document.ЕженедельныйОтчет</registeredDocuments>
  <columns>
    <name>ДлительностьРабот</name>
  </columns>
  <columns>
    <name>ДлительностьРабочая</name>
  </columns>
  <columns>
    <name>НекорректнаяДлительность</name>
  </columns>
  <columns>
    <name>Подразделение</name>
  </columns>
  <columns>
    <name>Пользователь</name>
  </columns>
</mdclass:DocumentJournal>

src/InformationRegisters/ИсполнителиРолейИДелегаты/ИсполнителиРолейИДелегаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиРолейИДелегаты</name>
  <dimensions>
    <name>ИсполнительДелегат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольПользователь</name>
    <type>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДелегирования</name>
    <comment>Настройку делегирования, по которой была сделана запись в регистре.</comment>
    <type>
      <types>CatalogRef.ДелегированиеПрав</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьРольПользователь</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбластиДелегирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DocumentJournals/УчетРабочегоВремени/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
	
// Возвращает список с подразделениями, в которых переданный пользователь является руководителем
// с учетом делегирования прав по ежедневным отчетам или всех прав
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Массив - Массив подразделений, где пользователь руководит непосредственно
//	или через делегирование. Отсортирован по представлениям подразделений.
//
Функция МассивПодразделенийДляПросмотраОтчетовОТрудозатратах(Пользователь) Экспорт

	ЗапросПользователей = Новый Запрос;
	ЗапросПользователей.Текст = 
		"ВЫБРАТЬ
		|	ИсполнителиРолейИДелегаты.РольПользователь КАК РольПользователь
		|ИЗ
		|	РегистрСведений.ИсполнителиРолейИДелегаты КАК ИсполнителиРолейИДелегаты
		|ГДЕ
		|	ИсполнителиРолейИДелегаты.ИсполнительДелегат = &ИсполнительДелегат
		|	И ИсполнителиРолейИДелегаты.НастройкаДелегирования <> ЗНАЧЕНИЕ(Справочник.ДелегированиеПрав.ПустаяСсылка)
		|	И (ИсполнителиРолейИДелегаты.ИмяОбластиДелегирования = ""ЕжедневныеОтчеты""
		|			ИЛИ ИсполнителиРолейИДелегаты.ИмяОбластиДелегирования = """")";
	
	ЗапросПользователей.УстановитьПараметр("ИсполнительДелегат", Пользователь);
	МассивПользователей = ЗапросПользователей.Выполнить().Выгрузить().ВыгрузитьКолонку("РольПользователь");
	МассивПользователей.Добавить(Пользователь);
	
	Подразделения = Справочники.СтруктураПредприятия.ПодчиненныеПодразделения(МассивПользователей);
	
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(Подразделения);
	СписокПодразделений.СортироватьПоЗначению();
	
	Возврат СписокПодразделений.ВыгрузитьЗначения();
	
КонецФункции

#КонецОбласти
